ccccmagicboy2022/airflow_meter/embeded/airflow_meter_b_board_app/driver/inc/n32g4fr_xfmc.h
    uint32_t WaitSigPolarity;   /*!< Specifies the wait signal polarity, valid only when accessing
                                    the Flash memory in burst mode.
                                    This parameter can be a value of @ref XFMC_Wait_Signal_Polarity */

    uint32_t WrapMode;          /*!< Enables or disables the Wrapped burst access mode for Flash
                                    memory, valid only when accessing Flash memories in burst mode.
                                    This parameter can be a value of @ref XFMC_Wrap_Mode */

    uint32_t WaitSigConfig;     /*!< Specifies if the wait signal is asserted by the memory one
                                    clock cycle before the wait state or during the wait state,
                                    valid only when accessing memories in burst mode.
                                    This parameter can be a value of @ref XFMC_Wait_Timing */

    uint32_t WriteEnable;       /*!< Enables or disables the write operation in the selected bank by the XFMC.
                                    This parameter can be a value of @ref XFMC_Write_Operation */

    uint32_t WaitSigEnable;     /*!< Enables or disables the wait-state insertion via wait
                                    signal, valid for Flash memory access in burst mode.
                                    This parameter can be a value of @ref XFMC_Wait_Signal */

    uint32_t ExtModeEnable;     /*!< Enables or disables the extended mode.
                                    This parameter can be a value of @ref XFMC_Extended_Mode */

    uint32_t WriteBurstEnable;  /*!< Enables or disables the write burst operation.
                                    This parameter can be a value of @ref XFMC_Write_Burst */

    XFMC_NorSramTimingInitType* RWTimingStruct; /*!< Timing Parameters for write and read access 
                                                        if the  ExtendedMode is not used*/

    XFMC_NorSramTimingInitType* WTimingStruct;  /*!< Timing Parameters for write access if the  
                                                        ExtendedMode is used*/
} XFMC_NorSramInitTpye;

/**
 * @brief  Timing parameters For XFMC NAND and PCCARD Banks
 */

typedef struct
{
    uint32_t SetTime;       /*!< Defines the number of HCLK cycles to setup address before
                                the command assertion for NAND-Flash read or write access
                                to common/Attribute or I/O memory space (depending on
                                the memory space timing to be configured).
                                This parameter can be a value between 0 and 0xFF.*/

    uint32_t WaitSetTime;   /*!< Defines the minimum number of HCLK cycles to assert the
                                command for NAND-Flash read or write access to
                                common/Attribute or I/O memory space (depending on the
                                memory space timing to be configured).
                                This parameter can be a number between 0x00 and 0xFF */

    uint32_t HoldSetTime;   /*!< Defines the number of HCLK clock cycles to hold address
                                (and data for write access) after the command deassertion
                                for NAND-Flash read or write access to common/Attribute
                                or I/O memory space (depending on the memory space timing
                                to be configured).
                                This parameter can be a number between 0x00 and 0xFF */

    uint32_t HiZSetTime;    /*!< Defines the number of HCLK clock cycles during which the
                                databus is kept in HiZ after the start of a NAND-Flash
                                write access to common/Attribute or I/O memory space (depending
                                on the memory space timing to be configured).
                                This parameter can be a number between 0x00 and 0xFF */
} XFMC_NandTimingInitType;

/**
 * @brief  XFMC NAND Init structure definition
 */

typedef struct
{
    XFMC_Bank23_Module *Bank;   /*!< Specifies the NAND memory bank that will be used.
                                    This parameter can be XFMC_BANK2 or XFMC_BANK3 */

    uint32_t WaitFeatureEnable; /*!< Enables or disables the Wait feature for the NAND Memory Bank.
                                    This parameter can be any value of @ref XFMC_Wait_feature */

    uint32_t MemDataWidth;      /*!< Specifies the external memory device width.
                                    This parameter can be any value of @ref XFMC_Data_Width */

    uint32_t EccEnable;         /*!< Enables or disables the ECC computation.
                                    This parameter can be any value of @ref XFMC_Ecc */

    uint32_t EccPageSize;       /*!< Defines the page size for the extended ECC.
                                    This parameter can be any value of @ref XFMC_ECC_Page_Size */

    uint32_t TCLRSetTime;       /*!< Defines the number of HCLK cycles to configure the
                                    delay between CLE low and RE low.
                                    This parameter can be a value between 0 and 0xFF. */

    uint32_t TARSetTime;        /*!< Defines the number of HCLK cycles to configure the
                                    delay between ALE low and RE low.
                                    This parameter can be a number between 0x0 and 0xFF */

    XFMC_NandTimingInitType* CommSpaceTimingStruct; /*!< XFMC Common Space Timing */

    XFMC_NandTimingInitType* AttrSpaceTimingStruct; /*!< XFMC Attribute Space Timing */
} XFMC_NandInitType;

/**
 * @brief  XFMC PCCARD Init structure definition
 */

typedef struct
{
    uint32_t WaitFeatureEnable; /*!< Enables or disables the Wait feature for the Memory Bank.
                                    This parameter can be any value of @ref XFMC_Wait_feature */

    uint32_t TCLRSetTime;       /*!< Defines the number of HCLK cycles to configure the
                                    delay between CLE low and RE low.
                                    This parameter can be a value between 0 and 0xFF. */

    uint32_t TARSetTime;        /*!< Defines the number of HCLK cycles to configure the
                                    delay between ALE low and RE low.
                                    This parameter can be a number between 0x0 and 0xFF */

