ccccmagicboy2022/airflow_meter/embeded/airflow_meter_b_board_app/driver/inc/n32g4fr_xfmc.h
    XFMC_NandTimingInitType* CommSpaceTimingStruct;     /*!< XFMC Common Space Timing */

    XFMC_NandTimingInitType* AttrSpaceTimingStruct;     /*!< XFMC Attribute Space Timing */

    XFMC_NandTimingInitType* XFMC_IOSpaceTimingStruct;  /*!< XFMC IO Space Timing */
} XFMC_PCCARDInitType;

/**
 * @}
 */

/** @addtogroup XFMC_Exported_Constants
 * @{
 */

/** @addtogroup XFMC_NORSRAM_Bank1_Reg_ResetValue
 * @{
 */
#define XFMC_NOR_SRAM_CR1_RESET         ((uint32_t)0x000030DB)
#define XFMC_NOR_SRAM_CR2_RESET         ((uint32_t)0x000030D2)
#define XFMC_NOR_SRAM_TR_RESET          ((uint32_t)0x0FFFFFFF)
#define XFMC_NOR_SRAM_WTR_RESET         ((uint32_t)0x0FFFFFFF)

/**
 * @}
 */

/** @addtogroup XFMC_NAND_Bank23_Reg_ResetValue
 * @{
 */
#define XFMC_NAND_CTRL_RESET            ((uint32_t)0x00000018)
#define XFMC_NAND_STS_RESET             ((uint32_t)0x00000040)
#define XFMC_NAND_CMEMTM_RESET          ((uint32_t)0xFCFCFCFC)
#define XFMC_NAND_ATTMEMTM_RESET        ((uint32_t)0xFCFCFCFC)

/**
 * @}
 */

#define IS_XFMC_NOR_SRAM_BLOCK(BLOCK)   (((BLOCK) == XFMC_BANK1_BLOCK1) || ((BLOCK) == XFMC_BANK1_BLOCK2))
#define IS_XFMC_NAND_BANK(BANK)         (((BANK) == XFMC_BANK2) || ((BANK) == XFMC_BANK3))


/** @addtogroup NOR_SRAM_Controller
 * @{
 */

/** @addtogroup XFMC_Data_Address_Bus_Multiplexing
 * @{
 */
#define XFMC_NOR_SRAM_DISABLE           ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_ENABLE            (XFMC_BANK1_CR_MBEN)
/**
 * @}
 */

/** @addtogroup XFMC_Data_Address_Bus_Multiplexing
 * @{
 */
#define XFMC_NOR_SRAM_MUX_DISABLE       ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_MUX_ENABLE        (XFMC_BANK1_CR_MUXEN)
#define IS_XFMC_NOR_SRAM_MUX(MUX)       (((MUX) == XFMC_NOR_SRAM_MUX_DISABLE) || ((MUX) == XFMC_NOR_SRAM_MUX_ENABLE))
/**
 * @}
 */

/** @addtogroup XFMC_Memory_Type
 * @{
 */
#define XFMC_MEM_TYPE_SRAM              ((uint32_t)0x00000000)
#define XFMC_MEM_TYPE_PSRAM             (XFMC_BANK1_CR_MTYPE_0)
#define XFMC_MEM_TYPE_NOR               (XFMC_BANK1_CR_MTYPE_1)
#define IS_XFMC_NOR_SRAM_MEMORY(MEMORY)                                                                                         \
    (((MEMORY) == XFMC_MEM_TYPE_SRAM) || ((MEMORY) == XFMC_MEM_TYPE_PSRAM) || ((MEMORY) == XFMC_MEM_TYPE_NOR))
/**
 * @}
 */

/** @addtogroup XFMC_Data_Width
 * @{
 */
#define XFMC_NOR_SRAM_DATA_WIDTH_8B     ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_DATA_WIDTH_16B    (XFMC_BANK1_CR_MDBW_0)
#define IS_XFMC_NOR_SRAM_MEMORY_WIDTH(WIDTH)     (((WIDTH) == XFMC_NOR_SRAM_DATA_WIDTH_8B) || ((WIDTH) == XFMC_NOR_SRAM_DATA_WIDTH_16B))
/**
 * @}
 */

/** @addtogroup XFMC_Flash_Access_Enable
 * @{
 */
#define XFMC_NOR_SRAM_ACC_DISABLE       ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_ACC_ENABLE        (XFMC_BANK1_CR_ACCEN)
/**
 * @}
 */

/** @addtogroup XFMC_Burst_Access_Mode
 * @{
 */
#define XFMC_NOR_SRAM_BURST_MODE_DISABLE    ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_BURST_MODE_ENABLE     (XFMC_BANK1_CR_BURSTEN)
#define IS_XFMC_NOR_SRAM_BURSTMODE(STATE)   (((STATE) == XFMC_NOR_SRAM_BURST_MODE_DISABLE) || ((STATE) == XFMC_NOR_SRAM_BURST_MODE_ENABLE))
/**
 * @}
 */

/** @addtogroup XFMC_Wait_Signal_Polarity
 * @{
 */
#define XFMC_NOR_SRAM_WAIT_SIGNAL_LOW   ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_WAIT_SIGNAL_HIGH  (XFMC_BANK1_CR_WAITDIR)
#define IS_XFMC_NOR_SRAM_WAIT_POLARITY(POLARITY)                                                                                \
    (((POLARITY) == XFMC_NOR_SRAM_WAIT_SIGNAL_LOW) || ((POLARITY) == XFMC_NOR_SRAM_WAIT_SIGNAL_HIGH))
/**
 * @}
 */

/** @addtogroup XFMC_Wrap_Mode
 * @{
 */
#define XFMC_NOR_SRAM_WRAP_DISABLE          ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_WRAP_ENABLE           (XFMC_BANK1_CR_WRAPEN)
#define IS_XFMC_NOR_SRAM_WRAP_MODE(MODE)    (((MODE) == XFMC_NOR_SRAM_WRAP_DISABLE) || ((MODE) == XFMC_NOR_SRAM_WRAP_ENABLE))
/**
 * @}
 */

/** @addtogroup XFMC_Wait_Timing
 * @{
 */
#define XFMC_NOR_SRAM_NWAIT_BEFORE_STATE    ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_NWAIT_DURING_STATE    (XFMC_BANK1_CR_WCFG)
#define IS_XFMC_NOR_SRAM_WAIT_SIGNAL_ACTIVE(ACTIVE)                                                                             \
    (((ACTIVE) == XFMC_NOR_SRAM_NWAIT_BEFORE_STATE) || ((ACTIVE) == XFMC_NOR_SRAM_NWAIT_DURING_STATE))
/**
 * @}
 */

/** @addtogroup XFMC_Write_Operation
 * @{
 */
#define XFMC_NOR_SRAM_WRITE_DISABLE                 ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_WRITE_ENABLE                  (XFMC_BANK1_CR_WREN)
#define IS_XFMC_NOR_SRAM_WRITE_OPERATION(OPERATION) (((OPERATION) == XFMC_NOR_SRAM_WRITE_DISABLE) || ((OPERATION) == XFMC_NOR_SRAM_WRITE_ENABLE))
/**
 * @}
 */

/** @addtogroup XFMC_Wait_Signal
 * @{
 */
#define XFMC_NOR_SRAM_NWAIT_DISABLE             ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_NWAIT_ENABLE              (XFMC_BANK1_CR_WAITEN)
#define IS_XFMC_NOR_SRAM_WAITE_SIGNAL(SIGNAL)   (((SIGNAL) == XFMC_NOR_SRAM_NWAIT_DISABLE) || ((SIGNAL) == XFMC_NOR_SRAM_NWAIT_ENABLE))
/**
 * @}
 */

/** @addtogroup XFMC_Extended_Mode
 * @{
 */
#define XFMC_NOR_SRAM_EXTENDED_DISABLE          ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_EXTENDED_ENABLE           (XFMC_BANK1_CR_EXTEN)
#define IS_XFMC_NOR_SRAM_EXTENDED_MODE(MODE)    (((MODE) == XFMC_NOR_SRAM_EXTENDED_DISABLE) || ((MODE) == XFMC_NOR_SRAM_EXTENDED_ENABLE))
/**
 * @}
 */

/** @addtogroup AsynchroWait
 * @{
 */
#define XFMC_NOR_SRAM_ASYNC_NWAIT_DISABLE   ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_ASYNC_NWAIT_ENABLE    (XFMC_BANK1_CR_WAITASYNC)
#define IS_XFMC_NOR_SRAM_ASYNWAIT(STATE)     (((STATE) == XFMC_NOR_SRAM_ASYNC_NWAIT_DISABLE) || ((STATE) == XFMC_NOR_SRAM_ASYNC_NWAIT_ENABLE))
/**
 * @}
 */


/** @addtogroup XFMC_Write_Burst
 * @{
 */
#define XFMC_NOR_SRAM_BURST_WRITE_DISABLE   ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_BURST_WRITE_ENABLE    (XFMC_BANK1_CR_BURSTWREN)
#define IS_XFMC_NOR_SRAM_WRITE_BURST(BURST) (((BURST) == XFMC_NOR_SRAM_BURST_WRITE_DISABLE) || ((BURST) == XFMC_NOR_SRAM_BURST_WRITE_ENABLE))
/**
 * @}
 */

/**
 * @} End of NOR_SRAM_Controller
 */
 

/** @addtogroup NOR_SRAM_Time_Control
 * @{
 */

