ccccmagicboy2022/airflow_meter/embeded/airflow_meter_b_board_app/driver/inc/n32g4fr_xfmc.h
/** @addtogroup XFMC_Address_Setup_Time
 * @{
 */
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_1HCLK         (0x0UL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_2HCLK         (0x1UL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_3HCLK         (0x2UL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_4HCLK         (0x3UL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_5HCLK         (0x4UL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_6HCLK         (0x5UL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_7HCLK         (0x6UL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_8HCLK         (0x7UL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_9HCLK         (0x8UL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_10HCLK        (0x9UL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_11HCLK        (0xAUL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_12HCLK        (0xBUL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_13HCLK        (0xCUL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_14HCLK        (0xDUL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_15HCLK        (0xEUL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_SETUP_TIME_16HCLK        (0xFUL << XFMC_BANK1_TR_ADDBLD_SHIFT)
#define IS_XFMC_NOR_SRAM_ADDR_SETUP_TIME(TIME)      (0==((TIME) & (~XFMC_BANK1_TR_ADDBLD_MASK)))
/**
 * @}
 */

/** @addtogroup XFMC_Address_Hold_Time
 * @{
 */
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_1HCLK          (0x0UL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_2HCLK          (0x1UL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_3HCLK          (0x2UL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_4HCLK          (0x3UL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_5HCLK          (0x4UL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_6HCLK          (0x5UL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_7HCLK          (0x6UL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_8HCLK          (0x7UL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_9HCLK          (0x8UL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_10HCLK         (0x9UL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_11HCLK         (0xAUL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_12HCLK         (0xBUL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_13HCLK         (0xCUL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_14HCLK         (0xDUL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_15HCLK         (0xEUL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define XFMC_NOR_SRAM_ADDR_HOLD_TIME_16HCLK         (0xFUL << XFMC_BANK1_TR_ADDHLD_SHIFT)
#define IS_XFMC_NOR_SRAM_ADDR_HOLD_TIME(TIME)       (0==((TIME) & (~XFMC_BANK1_TR_ADDHLD_MASK)))
/**
 * @}
 */

/** @addtogroup XFMC_Data_Setup_Time
 * @{
 */
#define XFMC_NOR_SRAM_DATA_SETUP_TIME_MIN           (0x01UL << XFMC_BANK1_TR_DATABLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_SETUP_TIME_MAX           (0xFFUL << XFMC_BANK1_TR_DATABLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_SETUP_TIME(x)            ((x) << XFMC_BANK1_TR_DATABLD_SHIFT)
#define IS_XFMC_NOR_SRAM_DATASETUP_TIME(TIME)       ( ((TIME) >= XFMC_NOR_SRAM_DATA_SETUP_TIME_MIN)    \
                                                  &&  ((TIME) <= XFMC_NOR_SRAM_DATA_SETUP_TIME_MAX) )
/**
 * @}
 */

/** @addtogroup XFMC_Bus_Recovery_Time
 * @{
 */
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_1HCLK        (0x0UL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_2HCLK        (0x1UL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_3HCLK        (0x2UL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_4HCLK        (0x3UL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_5HCLK        (0x4UL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_6HCLK        (0x5UL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_7HCLK        (0x6UL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_8HCLK        (0x7UL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_9HCLK        (0x8UL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_10HCLK       (0x9UL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_11HCLK       (0xAUL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_12HCLK       (0xBUL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_13HCLK       (0xCUL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_14HCLK       (0xDUL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_15HCLK       (0xEUL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define XFMC_NOR_SRAM_BUSRECOVERY_TIME_16HCLK       (0xFUL << XFMC_BANK1_TR_BUSRECOVERY_SHIFT)
#define IS_XFMC_NOR_SRAM_BUSRECOVERY_TIME(TIME)     (0==((TIME) & (~XFMC_BANK1_TR_BUSRECOVERY_MASK)))
/**
 * @}
 */

/** @addtogroup XFMC_CLK_Division
 * @{
 */
#define XFMC_NOR_SRAM_CLK_DIV_2             (0x1UL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_3             (0x2UL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_4             (0x3UL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_5             (0x4UL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_6             (0x5UL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_7             (0x6UL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_8             (0x7UL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_9             (0x8UL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_10            (0x9UL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_11            (0xAUL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_12            (0xBUL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_13            (0xCUL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_14            (0xDUL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_15            (0xEUL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define XFMC_NOR_SRAM_CLK_DIV_16            (0xFUL << XFMC_BANK1_TR_CLKDIV_SHIFT)
#define IS_XFMC_NOR_SRAM_CLK_DIV(DIV)       ( ((DIV) >= XFMC_NOR_SRAM_CLK_DIV_2)    \
                                            && ((DIV) <= XFMC_NOR_SRAM_CLK_DIV_16) )
/**
 * @}
 */

/** @addtogroup XFMC_Data_Latency
 * @{
 */
#define XFMC_NOR_SRAM_DATA_LATENCY_2CLK         (0x0UL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_3CLK         (0x1UL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_4CLK         (0x2UL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_5CLK         (0x3UL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_6CLK         (0x4UL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_7CLK         (0x5UL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_8CLK         (0x6UL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_9CLK         (0x7UL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_10CLK        (0x8UL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_11CLK        (0x9UL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_12CLK        (0xAUL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_13CLK        (0xBUL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_14CLK        (0xCUL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_15CLK        (0xDUL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_16CLK        (0xEUL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define XFMC_NOR_SRAM_DATA_LATENCY_17CLK        (0xFUL << XFMC_BANK1_TR_DATAHLD_SHIFT)
#define IS_XFMC_NOR_SRAM_DATA_LATENCY(TIME)     (0==((TIME) & (~XFMC_BANK1_TR_DATAHLD_MASK)))
/**
 * @}
 */

/** @addtogroup XFMC_Access_Mode
 * @{
 */
#define XFMC_NOR_SRAM_ACC_MODE_A     ((uint32_t)0x00000000)
#define XFMC_NOR_SRAM_ACC_MODE_B     (0x1UL << XFMC_BANK1_TR_ACCMODE_SHIFT)
#define XFMC_NOR_SRAM_ACC_MODE_C     (0x2UL << XFMC_BANK1_TR_ACCMODE_SHIFT)
#define XFMC_NOR_SRAM_ACC_MODE_D     (0x3UL << XFMC_BANK1_TR_ACCMODE_SHIFT)
#define IS_XFMC_NOR_SRAM_ACCESS_MODE(MODE)    ( ((MODE) == XFMC_NOR_SRAM_ACC_MODE_A) || ((MODE) == XFMC_NOR_SRAM_ACC_MODE_B)    \
                                             || ((MODE) == XFMC_NOR_SRAM_ACC_MODE_C) || ((MODE) == XFMC_NOR_SRAM_ACC_MODE_D) )
/**
 * @} End of NOR_SRAM_Time_Control
 */

/**
 * @}
 */

