ccccmagicboy2022/airflow_meter/embeded/airflow_meter_b_board_app/driver/inc/n32g4fr_xfmc.h
/** @addtogroup NAND_Controller
 * @{
 */

/** @addtogroup XFMC_Wait_feature
 * @{
 */
#define XFMC_NAND_NWAIT_DISABLE     ((uint32_t)0x00000000)
#define XFMC_NAND_NWAIT_ENABLE      (XFMC_CTRL_WAITEN)
#define IS_XFMC_NAND_WAIT_FEATURE(FEATURE)                                                                                  \
    (((FEATURE) == XFMC_NAND_NWAIT_DISABLE) || ((FEATURE) == XFMC_NAND_NWAIT_ENABLE))
/**
 * @}
 */

/** @addtogroup XFMC_Nand_Enable
 * @{
 */
#define XFMC_NAND_BANK_DISABLE      ((uint32_t)0x00000000)
#define XFMC_NAND_BANK_ENABLE       (XFMC_CTRL_BANKEN)
/**
 * @}
 */

/** @addtogroup XFMC_Bank23_Memory_Type
 * @{
 */
#define XFMC_BANK23_MEM_TYPE_NAND       (XFMC_CTRL_MEMTYPE)
#define IS_XFMC_BANK23_MEM_TYPE(TYPE)   ((TYPE) == XFMC_BANK23_MEM_TYPE_NAND)
/**
 * @}
 */

/** @addtogroup XFMC_Wait_feature
 * @{
 */
#define XFMC_NAND_BUS_WIDTH_8B      ((uint32_t)0x00000000)
#define XFMC_NAND_BUS_WIDTH_16B     (XFMC_CTRL_BUSWID_0)
#define IS_XFMC_NAND_BUS_WIDTH(WIDTH)    (((WIDTH) == XFMC_NAND_BUS_WIDTH_8B)||((WIDTH) == XFMC_NAND_BUS_WIDTH_16B))
/**
 * @}
 */

/** @addtogroup XFMC_Ecc
 * @{
 */
#define XFMC_NAND_ECC_DISABLE       ((uint32_t)0x00000000)
#define XFMC_NAND_ECC_ENABLE        (XFMC_CTRL_ECCEN)
#define IS_XFMC_ECC_STATE(STATE)    (((STATE) == XFMC_NAND_ECC_DISABLE) || ((STATE) == XFMC_NAND_ECC_ENABLE))
/**
 * @}
 */

/** @addtogroup XFMC_CLE_RE_Delay
 * @{
 */
#define XFMC_NAND_CLE_DELAY_1HCLK       (0x0UL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_2HCLK       (0x1UL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_3HCLK       (0x2UL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_4HCLK       (0x3UL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_5HCLK       (0x4UL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_6HCLK       (0x5UL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_7HCLK       (0x6UL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_8HCLK       (0x7UL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_9HCLK       (0x8UL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_10HCLK      (0x9UL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_11HCLK      (0xAUL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_12HCLK      (0xBUL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_13HCLK      (0xCUL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_14HCLK      (0xDUL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_15HCLK      (0xEUL << XFMC_CTRL_CRDLY_SHIFT)
#define XFMC_NAND_CLE_DELAY_16HCLK      (0xFUL << XFMC_CTRL_CRDLY_SHIFT)
#define IS_XFMC_NAND_CLE_DELAY(DELAY)   (0==((DELAY) & (~XFMC_CTRL_CRDLY_MASK)))
/**
 * @}
 */

/** @addtogroup XFMC_ALE_RE_Delay
 * @{
 */
#define XFMC_NAND_ALE_DELAY_1HCLK       (0x0UL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_2HCLK       (0x1UL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_3HCLK       (0x2UL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_4HCLK       (0x3UL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_5HCLK       (0x4UL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_6HCLK       (0x5UL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_7HCLK       (0x6UL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_8HCLK       (0x7UL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_9HCLK       (0x8UL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_10HCLK      (0x9UL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_11HCLK      (0xAUL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_12HCLK      (0xBUL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_13HCLK      (0xCUL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_14HCLK      (0xDUL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_15HCLK      (0xEUL << XFMC_CTRL_ARDLY_SHIFT)
#define XFMC_NAND_ALE_DELAY_16HCLK      (0xFUL << XFMC_CTRL_ARDLY_SHIFT)
#define IS_XFMC_NAND_ALE_DELAY(DELAY)   (0==((DELAY) & (~XFMC_CTRL_ARDLY_MASK)))
/**
 * @}
 */

/** @addtogroup XFMC_ECC_Page_Size
 * @{
 */
#define XFMC_NAND_ECC_PAGE_256BYTES         (0x0UL << XFMC_CTRL_ECCPGS_SHIFT)
#define XFMC_NAND_ECC_PAGE_512BYTES         (0x1UL << XFMC_CTRL_ECCPGS_SHIFT)
#define XFMC_NAND_ECC_PAGE_1024BYTES        (0x2UL << XFMC_CTRL_ECCPGS_SHIFT)
#define XFMC_NAND_ECC_PAGE_2048BYTES        (0x3UL << XFMC_CTRL_ECCPGS_SHIFT)
#define XFMC_NAND_ECC_PAGE_4096BYTES        (0x4UL << XFMC_CTRL_ECCPGS_SHIFT)
#define XFMC_NAND_ECC_PAGE_8192BYTES        (0x5UL << XFMC_CTRL_ECCPGS_SHIFT)
#define IS_XFMC_NAND_ECC_PAGE_SIZE(SIZE)    (0==((SIZE) & (~XFMC_CTRL_ECCPGS_MASK)))
/**
 * @}
 */

/**
 * @} End of NAND_Controller
 */

/** @addtogroup XFMC_StatusFlag
 * @{
 */
#define XFMC_NAND_FLAG_FIFO_EMPTY       (XFMC_STS_FIFOEMPT)
#define IS_XFMC_NAND_FLAG(FLAG)         ((FLAG)==XFMC_NAND_FLAG_FIFO_EMPTY)
/**
 * @}
 */


/** @addtogroup XFMC_TimeController
 * @{
 */

/** @addtogroup XFMC_Setup_Time
 * @{
 */
#define XFMC_NAND_SETUP_TIME_MIN        (0x00000000)
#define XFMC_NAND_SETUP_TIME_MAX        (0x000000FF)
#define XFMC_NAND_SETUP_TIME_DEFAULT    (0x000000FC)
#define IS_XFMC_NAND_SETUP_TIME(TIME)   ((TIME) <= XFMC_NAND_SETUP_TIME_MAX)
/**
 * @}
 */

/** @addtogroup XFMC_Wait_Time
 * @{
 */
#define XFMC_NAND_WAIT_TIME_MIN         (0x00000001)
#define XFMC_NAND_WAIT_TIME_MAX         (0x000000FF)
#define XFMC_NAND_WAIT_TIME_DEFAULT     (0x000000FC)
#define IS_XFMC_NAND_WAIT_TIME(TIME)    ( ((TIME) >= XFMC_NAND_WAIT_TIME_MIN)    \
                                    &&  ((TIME) <= XFMC_NAND_WAIT_TIME_MAX) )
/**
 * @}
 */

/** @addtogroup XFMC_Hold_Time
 * @{
 */
#define XFMC_NAND_HOLD_TIME_MIN         (0x00000001)
#define XFMC_NAND_HOLD_TIME_MAX         (0x000000FF)
#define XFMC_NAND_HOLD_TIME_DEFAULT     (0x000000FC)
#define IS_XFMC_NAND_HOLD_TIME(TIME)    ( ((TIME) >= XFMC_NAND_HOLD_TIME_MIN)    \
                                    &&  ((TIME) <= XFMC_NAND_HOLD_TIME_MAX) )
/**
 * @}
 */

/** @addtogroup XFMC_HiZ_Time
 * @{
 */
#define XFMC_NAND_HIZ_TIME_MIN          (0x00000000)
#define XFMC_NAND_HIZ_TIME_MAX          (0x000000FF)
#define XFMC_NAND_HIZ_TIME_DEFAULT      (0x000000FC)
#define IS_XFMC_NAND_HIZ_TIME(TIME)     ((TIME) <= XFMC_NAND_HIZ_TIME_MAX)
/**
 * @}
 */

/**
 * @} End of XFMC_TimeController
 */

/**
 * @}
 */

/**
 * @}
 */

/** @addtogroup XFMC_Exported_Macros
 * @{
 */

/**
 * @}
 */

/** @addtogroup XFMC_Exported_Functions
 * @{
 */

void XFMC_DeInitNorSram(XFMC_Bank1_Block *Block);
void XFMC_DeInitNand(XFMC_Bank23_Module *Bank);
void XFMC_InitNorSram(XFMC_NorSramInitTpye* XFMC_NORSRAMInitStruct);
void XFMC_InitNand(XFMC_NandInitType* XFMC_NANDInitStruct);
void XFMC_InitNorSramStruct(XFMC_NorSramInitTpye* XFMC_NORSRAMInitStruct);
void XFMC_InitNandStruct(XFMC_NandInitType* XFMC_NANDInitStruct);
void XFMC_EnableNorSram(XFMC_Bank1_Block *Block, FunctionalState Cmd);
void XFMC_EnableNand(XFMC_Bank23_Module *Bank, FunctionalState Cmd);
void XFMC_EnableNandEcc(XFMC_Bank23_Module *Bank, FunctionalState Cmd);
void XFMC_RestartNandEcc(XFMC_Bank23_Module *Bank);
uint32_t XFMC_GetEcc(XFMC_Bank23_Module *Bank);
FlagStatus XFMC_GetFlag(XFMC_Bank23_Module *Bank, uint32_t XFMC_FLAG);
void XFMC_ClrFlag(XFMC_Bank23_Module *Bank, uint32_t XFMC_FLAG);
/**
 * @}
 */

#ifdef __cplusplus
}
#endif

#endif /*__N32G4FR_XFMC_H__ */
/**
 * @}
 */

/**
 * @}
 */
